app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
			<tbody>
				<% @user.books.each do |book| %>

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
					<td><%= book.body %></td>
					<td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>