app/views/books/index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
---
					<td><%= book.body %></td>
					<td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
              <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
              <%= book.favorites.count %> いいね