app/views/books/show.html.erb

					<td><%= @book.body %></td>
					<td><%= link_to "#{@book.book_comments.count} コメント", book_path(@book.id) %></td>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

            <div class="float-wrapper">
              <h2 class="comment-count"><%= @book.book_comments.count %>件コメント</h2>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

                  <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
                  <%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

                  <i class="fa fa-heart-o" aria-hidden="true"></i>
                  <%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

	            <ol>
	              <% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]