app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  def show
  	@user = User.find(params[:id])
  	@books = Book.where(user_id: current_user.id)

SELECT "users".* FROM "users"
---
  def index
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", nil], ["updated_at", "2020-06-03 07:02:38.533720"], ["id", 1]]
---
  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)